Revit 2027 API
ParameterTypeId.AnalyticalModelSketchAlignmentMethod Property
 "Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelSketchAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelSketchAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelSketchAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelSketchAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace